// Pre-install confirmation
"CONFIRM_AT_LOGOUT_BEFORE_RESTART_TITLE" = "Tietokoneelle on asennettavia ohjelmistopäivityksiä. Haluatko asentaa ne ennen tietokoneen käynnistämistä uudelleen?";
"WILL_RESTART_COUNTDOWN_MESSAGE_FORMAT" = "Jos et tee mitään, päivitykset asennetaan ja tietokone käynnistyy uudelleen %@ kuluttua.";
"INSTALL_AND_RESTART_TITLE" = "Asenna ja käynnistä uudelleen";
"RESTART_TITLE" = "Käynnistä uudelleen";

"CONFIRM_AT_LOGOUT_BEFORE_SHUTDOWN_TITLE" = "Tietokoneelle on asennettavia ohjelmistopäivityksiä. Haluatko asentaa ne ennen tietokoneen sammuttamista?";
"WILL_SHUTDOWN_COUNTDOWN_MESSAGE_FORMAT" = "Jos et tee mitään, päivitykset asennetaan ja tietokone sammuu %@ kuluttua.";
"INSTALL_AND_SHUT_DOWN_TITLE" = "Asenna ja sammuta";
"SHUT_DOWN_TITLE" = "Sammuta";

// Disk verify title
"CHECKING_DISK_STATUS" = "Varmistetaan levyä…";

"DISK_FAILED_VERIFY_TITLE" = "Ennen kuin ohjelmistopäivitykset voidaan asentaa, käynnistyslevy on korjattava.";
"DISK_FAILED_VERIFY_MESSAGE" = "Käynnistyslevyllä on ongelma, joka voidaan ehkä korjata käynnistämällä tietokone uudelleen. Kun olet käynnistänyt tietokoneen uudelleen, asenna päivitykset avaamalla Ohjelmiston päivitys uudelleen. Jos tämä viesti tulee jälleen näkyviin, ota yhteyttä Applen tukeen.";

// time remaining
"SYSTEM_WILL_RESTART_MESSAGE" = "Tietokone käynnistyy uudelleen automaattisesti.";
"SYSTEM_WILL_SHUT_DOWN_MESSAGE" = "Tietokone sammuu automaattisesti.";
